---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimStyleCenterlineTickMark
source: html/9940796a-9081-4bcb-8565-61957c85546c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimStyleCenterlineTickMark Property

"Centerline Tick Mark"

## Syntax (C#)
```csharp
public static ForgeTypeId DimStyleCenterlineTickMark { get; }
```